jankaluza/qsimkit/CPU/Variants/msp430x43x.cpp
#define SCFI0_ 0x0050
#endif
#ifndef ADC12MCTL8_
#define ADC12MCTL8_ 0x0088
#endif
#ifndef SCFI1_
#define SCFI1_ 0x0051
#endif
#ifndef BT_fCLK2_ACLK
#define BT_fCLK2_ACLK 0x00
#endif
#ifndef ADC12MCTL9_
#define ADC12MCTL9_ 0x0089
#endif
#ifndef CONSEQ_REPEAT_SEQUENCE
#define CONSEQ_REPEAT_SEQUENCE CONSEQ_3
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef UTCTL_
#define UTCTL_ 0x0071
#endif
#ifndef SCFQ_4M
#define SCFQ_4M 0x7F
#endif
#ifndef TXBUF_
#define TXBUF_ 0x0077
#endif
#ifndef INCH_TEMP
#define INCH_TEMP 10
#endif
#ifndef URCTL0_
#define URCTL0_ 0x0072
#endif
#ifndef P6OUT_
#define P6OUT_ 0x0035
#endif
#ifndef TBSSEL_INCLK
#define TBSSEL_INCLK TBSSEL_3
#endif
#ifndef CSTARTADD0
#define CSTARTADD0 0x1000
#endif
#ifndef SCFQ_128K
#define SCFQ_128K 0x03
#endif
#ifndef UCTL0_
#define UCTL0_ 0x0070
#endif
#ifndef ADC12SSEL0
#define ADC12SSEL0 0x0008
#endif
#ifndef ADC12SSEL1
#define ADC12SSEL1 0x0010
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef ADC12IV_
#define ADC12IV_ 0x01A8
#endif
#ifndef __msp430_headers_lcd_h
#define __msp430_headers_lcd_h 
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef TBCLGRP0
#define TBCLGRP0 0x2000
#endif
#ifndef TBCLGRP1
#define TBCLGRP1 0x4000
#endif
#ifndef UMCTL_
#define UMCTL_ 0x0073
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef URXEIE
#define URXEIE 0x08
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 102
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef ADC12MEM0_
#define ADC12MEM0_ ADC12MEM_
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef ADC12MEM1_
#define ADC12MEM1_ 0x0142
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TIMERB1_VECTOR
#define TIMERB1_VECTOR 24
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef SHR0
#define SHR0 0x2000
#endif
#ifndef SHR1
#define SHR1 0x4000
#endif
#ifndef FLLD_1
#define FLLD_1 0
#endif
#ifndef ADC12MEM
#define ADC12MEM ADC12MEM_
#endif
#ifndef __msp430_have_port3
#define __msp430_have_port3 
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef TBCCR1_
#define TBCCR1_ 0x0194
#endif
#ifndef TXWAKE
#define TXWAKE 0x04
#endif
#ifndef ADC12MEM3_
#define ADC12MEM3_ 0x0146
#endif
#ifndef SHS1
#define SHS1 0x0800
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 2
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef TBCCR2_
#define TBCCR2_ 0x0196
#endif
#ifndef CACTL24
#define CACTL24 0x10
#endif
#ifndef CACTL25
#define CACTL25 0x20
#endif
#ifndef CACTL26
#define CACTL26 0x40
#endif
#ifndef CACTL27
#define CACTL27 0x80
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 22
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef TBCCTL0_
#define TBCCTL0_ 0x0182
#endif
#ifndef SREF_AVCC_VEREF
#define SREF_AVCC_VEREF SREF_4
#endif
#ifndef ADC12MEM5_
#define ADC12MEM5_ 0x014A
#endif
#ifndef FLL_DIV_1
#define FLL_DIV_1 0x00
#endif
#ifndef FLL_DIV_2
#define FLL_DIV_2 0x01
#endif
#ifndef FLL_DIV_4
#define FLL_DIV_4 0x02
#endif
#ifndef FLL_DIV_8
#define FLL_DIV_8 0x03
#endif
#ifndef TBCCTL1_
#define TBCCTL1_ 0x0184
#endif
#ifndef __MSP430_HAS_COMPA__
#define __MSP430_HAS_COMPA__ 
#endif
#ifndef ADC12MEM6_
#define ADC12MEM6_ 0x014C
#endif
#ifndef TBCCTL2_
#define TBCCTL2_ 0x0186
#endif
#ifndef ADC12MEM7_
#define ADC12MEM7_ 0x014E
#endif
#ifndef SHT1_DIV4
#define SHT1_DIV4 SHT1_0
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef __MSP430_HAS_ADC12__
#define __MSP430_HAS_ADC12__ 
#endif
#ifndef SSEL_ACLK
#define SSEL_ACLK SSEL_1
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef ADC12MEM8_
#define ADC12MEM8_ 0x0150
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ int
#endif
#ifndef UBR1_0_
#define UBR1_0_ 0x0075
#endif
#ifndef INCH_0
#define INCH_0 0
#endif
#ifndef INCH_1
#define INCH_1 1
#endif
#ifndef INCH_2
#define INCH_2 2
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef INCH_4
#define INCH_4 4
#endif
#ifndef INCH_5
#define INCH_5 5
#endif
#ifndef INCH_6
#define INCH_6 6
#endif
#ifndef INCH_7
#define INCH_7 7
#endif
#ifndef INCH_8
#define INCH_8 8
#endif
#ifndef INCH_9
#define INCH_9 9
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef SCFQCTL_
#define SCFQCTL_ 0x0052
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef ADC12MEM9_
#define ADC12MEM9_ 0x0152
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef DCOPLUS
#define DCOPLUS 0x80
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef BTSSEL
#define BTSSEL 0x80
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef BTHOLD
#define BTHOLD 0x40
#endif
#ifndef U0MCTL_
#define U0MCTL_ 0x0073
#endif
#ifndef __msp430_headers_usart_h
#define __msp430_headers_usart_h 
#endif
#ifndef P6DIR_
#define P6DIR_ 0x0036
#endif
#ifndef TBIV_CCR1
#define TBIV_CCR1 0x02
#endif
#ifndef TBIV_CCR2
#define TBIV_CCR2 0x04
#endif
#ifndef ADC12MCTL3_
#define ADC12MCTL3_ 0x0083
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef SHS_TACCR1
#define SHS_TACCR1 SHS_1
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef FN_2
#define FN_2 0x04
#endif
#ifndef FN_3
#define FN_3 0x08
#endif
#ifndef FN_4
#define FN_4 0x10
#endif
#ifndef FN_8
#define FN_8 0x20
#endif
#ifndef U0RXBUF_
#define U0RXBUF_ 0x0076
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef SHT1_DIV128
#define SHT1_DIV128 SHT1_6
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 8
#endif
#ifndef ADC12SSEL_SMCLK
#define ADC12SSEL_SMCLK ADC12SSEL_3
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef __MSP430_HAS_PORT1__
#define __MSP430_HAS_PORT1__ 
#endif
#ifndef BTIP0
#define BTIP0 0x01
#endif
#ifndef BTIP1
#define BTIP1 0x02
#endif
#ifndef BTIP2
#define BTIP2 0x04
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef INCH_A4
#define INCH_A4 4
#endif
#ifndef BRK
#define BRK 0x10
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef INCH_A7
#define INCH_A7 7
#endif
#ifndef __VERSION__
#define __VERSION__ "3.2.3"
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef SHT1_DIV8
#define SHT1_DIV8 SHT1_1
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x43x : public Variant {
	public:
		Variant_msp430x43x() {}
		virtual ~Variant_msp430x43x() {}
		const char *getName() { return "msp430x43x"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


